apache/nuttx/arch/arm/src/stm32l4/stm32l4_serial.c
#ifdef USE_SERIALDRIVER
#ifdef HAVE_UART

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32_serial_s
{
  struct uart_dev_s dev;       /* Generic UART device */
  uint16_t          ie;        /* Saved interrupt mask bits value */
  uint16_t          sr;        /* Saved status bits */

  /* Has been initialized and HW is setup. */

  bool              initialized;

#ifdef CONFIG_PM
  bool              suspended; /* UART device has been suspended. */

  /* Interrupt mask value stored before suspending for stop mode. */

  uint16_t          suspended_ie;
#endif

  /* If termios are supported, then the following fields may vary at
   * runtime.
   */

#ifdef CONFIG_SERIAL_TERMIOS
  uint8_t           parity;    /* 0=none, 1=odd, 2=even */
  uint8_t           bits;      /* Number of bits (7 or 8) */
  bool              stopbits2; /* True: Configure with 2 stop bits instead of 1 */
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  bool              iflow;     /* input flow control (RTS) enabled */
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  bool              oflow;     /* output flow control (CTS) enabled */
#endif
  uint32_t          baud;      /* Configured baud */
#else
  const uint8_t     parity;    /* 0=none, 1=odd, 2=even */
  const uint8_t     bits;      /* Number of bits (7 or 8) */
  const bool        stopbits2; /* True: Configure with 2 stop bits instead of 1 */
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  const bool        iflow;     /* input flow control (RTS) enabled */
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  const bool        oflow;     /* output flow control (CTS) enabled */
#endif
  const uint32_t    baud;      /* Configured baud */
#endif

  const uint8_t     irq;       /* IRQ associated with this USART */
  const uint32_t    apbclock;  /* PCLK 1 or 2 frequency */
  const uint32_t    usartbase; /* Base address of USART registers */
  const uint32_t    tx_gpio;   /* U[S]ART TX GPIO pin configuration */
  const uint32_t    rx_gpio;   /* U[S]ART RX GPIO pin configuration */
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  const uint32_t    rts_gpio;  /* U[S]ART RTS GPIO pin configuration */
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  const uint32_t    cts_gpio;  /* U[S]ART CTS GPIO pin configuration */
#endif

#ifdef SERIAL_HAVE_RXDMA
  const unsigned int rxdma_channel; /* DMA channel assigned */
#endif

  /* RX DMA state */

#ifdef SERIAL_HAVE_RXDMA
  DMA_HANDLE        rxdma;     /* currently-open receive DMA stream */
  bool              rxenable;  /* DMA-based reception en/disable */
#ifdef CONFIG_PM
  bool              rxdmasusp; /* Rx DMA suspended */
#endif
  uint32_t          rxdmanext; /* Next byte in the DMA buffer to be read */
  char       *const rxfifo;    /* Receive DMA buffer */
#endif

#ifdef HAVE_RS485
  const uint32_t    rs485_dir_gpio;     /* U[S]ART RS-485 DIR GPIO pin configuration */
  const bool        rs485_dir_polarity; /* U[S]ART RS-485 DIR pin state for TX enabled */
#endif
  spinlock_t        lock;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void stm32l4serial_setformat(struct uart_dev_s *dev);
#endif
static int  stm32l4serial_setup(struct uart_dev_s *dev);
static void stm32l4serial_shutdown(struct uart_dev_s *dev);
static int  stm32l4serial_attach(struct uart_dev_s *dev);
static void stm32l4serial_detach(struct uart_dev_s *dev);
static int  up_interrupt(int irq, void *context, void *arg);
static int  stm32l4serial_ioctl(struct file *filep, int cmd,
                                unsigned long arg);
#ifndef SERIAL_HAVE_ONLY_DMA
static int  stm32l4serial_receive(struct uart_dev_s *dev,
                                  unsigned int *status);
static void stm32l4serial_rxint(struct uart_dev_s *dev, bool enable);
static bool stm32l4serial_rxavailable(struct uart_dev_s *dev);
#endif
#ifdef CONFIG_SERIAL_IFLOWCONTROL
static bool stm32l4serial_rxflowcontrol(struct uart_dev_s *dev,
                                        unsigned int nbuffered, bool upper);
#endif
static void stm32l4serial_send(struct uart_dev_s *dev, int ch);
static void stm32l4serial_txint(struct uart_dev_s *dev, bool enable);
static bool stm32l4serial_txready(struct uart_dev_s *dev);

#ifdef SERIAL_HAVE_RXDMA
static int  stm32l4serial_dmasetup(struct uart_dev_s *dev);
static void stm32l4serial_dmashutdown(struct uart_dev_s *dev);
static int  stm32l4serial_dmareceive(struct uart_dev_s *dev,
                                     unsigned int *status);
static void stm32l4serial_dmareenable(struct stm32_serial_s *priv);
#ifdef CONFIG_SERIAL_IFLOWCONTROL
static bool stm32l4serial_dmaiflowrestart(struct stm32_serial_s *priv);
#endif
static void stm32l4serial_dmarxint(struct uart_dev_s *dev, bool enable);
static bool stm32l4serial_dmarxavailable(struct uart_dev_s *dev);

static void stm32l4serial_dmarxcallback(DMA_HANDLE handle, uint8_t status,
                                        void *arg);
#endif

#ifdef CONFIG_PM
static void stm32l4serial_setsuspend(struct uart_dev_s *dev, bool suspend);
static void stm32l4serial_pm_setsuspend(bool suspend);
static void stm32l4serial_pmnotify(struct pm_callback_s *cb, int domain,
                                   enum pm_state_e pmstate);
static int  stm32l4serial_pmprepare(struct pm_callback_s *cb, int domain,
                                    enum pm_state_e pmstate);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifndef SERIAL_HAVE_ONLY_DMA
static const struct uart_ops_s g_uart_ops =
{
  .setup          = stm32l4serial_setup,
  .shutdown       = stm32l4serial_shutdown,
  .attach         = stm32l4serial_attach,
  .detach         = stm32l4serial_detach,
  .ioctl          = stm32l4serial_ioctl,
  .receive        = stm32l4serial_receive,
  .rxint          = stm32l4serial_rxint,
  .rxavailable    = stm32l4serial_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = stm32l4serial_rxflowcontrol,
#endif
  .send           = stm32l4serial_send,
  .txint          = stm32l4serial_txint,
  .txready        = stm32l4serial_txready,
  .txempty        = stm32l4serial_txready,
};
#endif

