apache/nuttx/arch/arm/src/stm32l4/stm32l4_serial.c
  priv->ie = ie;

  /* And restore the interrupt state (see the interrupt
   * enable/usage table above)
   */

  cr = stm32l4serial_getreg(priv, STM32_USART_CR1_OFFSET);
  cr &= ~(USART_CR1_USED_INTS);
  cr |= (ie & (USART_CR1_USED_INTS));
  stm32l4serial_putreg(priv, STM32_USART_CR1_OFFSET, cr);

  cr = stm32l4serial_getreg(priv, STM32_USART_CR3_OFFSET);
  cr &= ~USART_CR3_EIE;
  cr |= (ie & USART_CR3_EIE);
  stm32l4serial_putreg(priv, STM32_USART_CR3_OFFSET, cr);
}

/****************************************************************************
 * Name: up_restoreusartint
 ****************************************************************************/

static void stm32l4serial_restoreusartint(struct stm32_serial_s *priv,
                                          uint16_t ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  stm32l4serial_setusartint(priv, ie);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: stm32l4serial_disableusartint
 ****************************************************************************/

static void stm32l4serial_disableusartint(struct stm32_serial_s *priv,
                                          uint16_t *ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  if (ie)
    {
      uint32_t cr1;
      uint32_t cr3;

      /* USART interrupts:
       *
       * Enable             Status          Meaning            Usage
       * ------------------ --------------- ------------------ ----------
       * USART_CR1_IDLEIE   USART_ISR_IDLE   Idle Line
       *                                     Detected          (not used)
       * USART_CR1_RXNEIE   USART_ISR_RXNE   Received Data
       *                                     Ready to be Read
       * "              "   USART_ISR_ORE    Overrun Error
       *                                     Detected
       * USART_CR1_TCIE     USART_ISR_TC     Transmission
       *                                     Complete          (used only
       *                                                        for RS-485)
       * USART_CR1_TXEIE    USART_ISR_TXE    Transmit Data
       *                                     Register Empty
       * USART_CR1_PEIE     USART_ISR_PE     Parity Error
       *
       * USART_CR2_LBDIE    USART_ISR_LBD    Break Flag        (not used)
       * USART_CR3_EIE      USART_ISR_FE     Framing Error
       * "           "      USART_ISR_NF     Noise Flag
       * "           "      USART_ISR_ORE    Overrun Error
       *                                     Detected
       * USART_CR3_CTSIE    USART_ISR_CTS    CTS flag          (not used)
       */

      cr1 = stm32l4serial_getreg(priv, STM32_USART_CR1_OFFSET);
      cr3 = stm32l4serial_getreg(priv, STM32_USART_CR3_OFFSET);

      /* Return the current interrupt mask value for the used interrupts.
       * Notice that this depends on the fact that none of the used interrupt
       * enable bits overlap. This logic would fail if we needed the break
       * interrupt!
       */

      *ie = (cr1 & (USART_CR1_USED_INTS)) | (cr3 & USART_CR3_EIE);
    }

  /* Disable all interrupts */

  stm32l4serial_setusartint(priv, 0);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: stm32l4serial_dmanextrx
 *
 * Description:
 *   Returns the index into the RX FIFO where the DMA will place the next
 *   byte that it receives.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static int stm32l4serial_dmanextrx(struct stm32_serial_s *priv)
{
  size_t dmaresidual;

  dmaresidual = stm32_dmaresidual(priv->rxdma);

  return (RXDMA_BUFFER_SIZE - (int)dmaresidual);
}
#endif

/****************************************************************************
 * Name: stm32l4serial_setbaud_usart
 *
 * Description:
 *   Set the serial line baud rate (standard UART and USART).
 *
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void stm32l4serial_setbaud_usart(struct stm32_serial_s *priv)
{
  /* This first implementation is for U[S]ARTs that support oversampling
   * by 8 in additional to the standard oversampling by 16.
   */

  uint32_t usartdiv8;
  uint32_t cr1;
  uint32_t brr;

  /* In case of oversampling by 8, the equation is:
   *
   *   baud      = 2 * fCK / usartdiv8
   *   usartdiv8 = 2 * fCK / baud
   */

  usartdiv8 = ((priv->apbclock << 1) + (priv->baud >> 1)) / priv->baud;

  /* Baud rate for standard USART (SPI mode included):
   *
   * In case of oversampling by 16, the equation is:
   *   baud       = fCK / usartdiv16
   *   usartdiv16 = fCK / baud
   *              = 2 * usartdiv8
   */

  /* Use oversamply by 8 only if the divisor is small.  But what is small? */

  cr1 = stm32l4serial_getreg(priv, STM32_USART_CR1_OFFSET);
  brr = stm32l4serial_getreg(priv, STM32_USART_BRR_OFFSET);
  brr &= ~(USART_BRR_MANT_MASK | USART_BRR_FRAC_MASK);

  if (usartdiv8 > 100)
    {
      /* Use usartdiv16 */

      brr  |= (usartdiv8 + 1) >> 1;

      /* Clear oversampling by 8 to enable oversampling by 16 */

      cr1 &= ~USART_CR1_OVER8;
    }
  else
    {
      DEBUGASSERT(usartdiv8 >= 8);

      /* Perform mysterious operations on bits 0-3 */

      brr  |= ((usartdiv8 & 0xfff0) | ((usartdiv8 & 0x000f) >> 1));

      /* Set oversampling by 8 */

      cr1 |= USART_CR1_OVER8;
    }

  stm32l4serial_putreg(priv, STM32_USART_CR1_OFFSET, cr1);
  stm32l4serial_putreg(priv, STM32_USART_BRR_OFFSET, brr);
}
#endif

/****************************************************************************
 * Name: stm32l4serial_setbaud_lpuart
 *
 * Description:
 *   Set the serial line baud rate (LPUART only).
 *
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
#ifdef CONFIG_STM32_LPUART1_SERIALDRIVER
static void stm32l4serial_setbaud_lpuart(struct stm32_serial_s *priv)
{
  uint32_t brr;

  /* The equation is:
   *
   *   baud = 256 * fCK / brr
   *   brr  = 256 * fCK / baud
   *
   * It is forbidden to write values lower than LPUART_BRR_MIN in
   * the LPUART_BRR register. fCK must range from 3 x baud rate to
   * 4096 x baud rate.
   */

  brr = (((uint64_t)priv->apbclock << 8) + (priv->baud >> 1)) / priv->baud;
  brr &= LPUART_BRR_MASK;

  if (brr < LPUART_BRR_MIN)
    {
      brr = LPUART_BRR_MIN;
    }

  stm32l4serial_putreg(priv, STM32_USART_BRR_OFFSET, brr);
}
#endif
#endif

/****************************************************************************
 * Name: stm32l4serial_setformat
 *
 * Description:
 *   Set the serial line format and speed.
 *
 ****************************************************************************/

