apache/nuttx/arch/arm/src/stm32l4/stm32l4_serial.c
      priv->sr = stm32l4serial_getreg(priv, STM32_USART_ISR_OFFSET);

      /* USART interrupts:
       *
       * Enable             Status          Meaning             Usage
       * ------------------ --------------- ------------------- ----------
       * USART_CR1_IDLEIE   USART_ISR_IDLE   Idle Line
       *                                     Detected           (not used)
       * USART_CR1_RXNEIE   USART_ISR_RXNE   Received Data
       *                                     Ready to be Read
       * "              "   USART_ISR_ORE    Overrun Error
       *                                     Detected
       * USART_CR1_TCIE     USART_ISR_TC     Transmission
       *                                     Complete           (used only
       *                                                         for RS-485)
       * USART_CR1_TXEIE    USART_ISR_TXE    Transmit Data
       *                                     Register Empty
       * USART_CR1_PEIE     USART_ISR_PE     Parity Error
       *
       * USART_CR2_LBDIE    USART_ISR_LBD    Break Flag         (not used)
       * USART_CR3_EIE      USART_ISR_FE     Framing Error
       * "           "      USART_ISR_NE     Noise Error
       * "           "      USART_ISR_ORE    Overrun Error
       *                                     Detected
       * USART_CR3_CTSIE    USART_ISR_CTS    CTS flag           (not used)
       *
       * NOTE: Some of these status bits must be cleared by explicitly
       * writing one to the ICR register: USART_ICR_CTSCF, USART_ICR_LBDCF.
       * Note of those are currently being used.
       */

#ifdef HAVE_RS485
      /* Transmission of whole buffer is over - TC is set, TXEIE is cleared.
       * Note - this should be first, to have the most recent TC bit value
       * from SR register - sending data affects TC, but without refresh we
       * will not know that...
       */

      if ((priv->sr & USART_ISR_TC) != 0 &&
          (priv->ie & USART_CR1_TCIE) != 0 &&
          (priv->ie & USART_CR1_TXEIE) == 0)
        {
          stm32_gpiowrite(priv->rs485_dir_gpio, !priv->rs485_dir_polarity);
          stm32l4serial_restoreusartint(priv, priv->ie & ~USART_CR1_TCIE);
        }
#endif

      /* Handle incoming, receive bytes. */

      if ((priv->sr & USART_ISR_RXNE) != 0 &&
          (priv->ie & USART_CR1_RXNEIE) != 0)
        {
          /* Received data ready... process incoming bytes.  NOTE the check
           * for RXNEIE:  We cannot call uart_recvchards of RX interrupts
           * are disabled.
           */

          uart_recvchars(&priv->dev);
          handled = true;
        }

      /* We may still have to read from the DR register to clear any pending
       * error conditions.
       */

      else if ((priv->sr &
                (USART_ISR_ORE | USART_ISR_NF | USART_ISR_FE)) != 0)
        {
          /* These errors are cleared by writing the corresponding bit to the
           * interrupt clear register (ICR).
           */

          stm32l4serial_putreg(priv, STM32_USART_ICR_OFFSET,
                               (USART_ICR_NCF | USART_ICR_ORECF |
                                USART_ICR_FECF));
        }

      /* Handle outgoing, transmit bytes */

      if ((priv->sr & USART_ISR_TXE) != 0 &&
          (priv->ie & USART_CR1_TXEIE) != 0)
        {
          /* Transmit data register empty ... process outgoing bytes */

          uart_xmitchars(&priv->dev);
          handled = true;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: stm32l4serial_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int stm32l4serial_ioctl(struct file *filep, int cmd,
                               unsigned long arg)
{
#if defined(CONFIG_SERIAL_TERMIOS) || defined(CONFIG_SERIAL_TIOCSERGSTRUCT)
  struct inode      *inode = filep->f_inode;
  struct uart_dev_s *dev   = inode->i_private;
#endif
#if defined(CONFIG_SERIAL_TERMIOS)
  struct stm32_serial_s *priv =
      (struct stm32_serial_s *)dev->priv;
#endif
  int                ret    = OK;

  switch (cmd)
    {
#ifdef CONFIG_SERIAL_TIOCSERGSTRUCT
    case TIOCSERGSTRUCT:
      {
        struct stm32_serial_s *user =
            (struct stm32_serial_s *)arg;
        if (!user)
          {
            ret = -EINVAL;
          }
        else
          {
            memcpy(user, dev, sizeof(struct stm32_serial_s));
          }
      }
      break;
#endif

#ifdef CONFIG_STM32_USART_SINGLEWIRE
    case TIOCSSINGLEWIRE:
      {
        uint32_t cr1;
        uint32_t cr1_ue;
        irqstate_t flags;

        flags = enter_critical_section();

        /* Get the original state of UE */

        cr1    = stm32l4serial_getreg(priv, STM32_USART_CR1_OFFSET);
        cr1_ue = cr1 & USART_CR1_UE;
        cr1   &= ~USART_CR1_UE;

        /* Disable UE, HDSEL can only be written when UE=0 */

        stm32l4serial_putreg(priv, STM32_USART_CR1_OFFSET, cr1);

        /* Change the TX port to be open-drain/push-pull and enable/disable
         * half-duplex mode.
         */

        uint32_t cr = stm32l4serial_getreg(priv, STM32_USART_CR3_OFFSET);

        if ((arg & SER_SINGLEWIRE_ENABLED) != 0)
          {
            uint32_t gpio_val = (arg & SER_SINGLEWIRE_PUSHPULL) ==
                                 SER_SINGLEWIRE_PUSHPULL ?
                                 GPIO_PUSHPULL : GPIO_OPENDRAIN;
            gpio_val |=
              (arg & SER_SINGLEWIRE_PULL_MASK) == SER_SINGLEWIRE_PULLUP ?
                                                  GPIO_PULLUP : GPIO_FLOAT;

            gpio_val |=
              (arg & SER_SINGLEWIRE_PULL_MASK) == SER_SINGLEWIRE_PULLDOWN ?
                                                  GPIO_PULLDOWN : GPIO_FLOAT;

            if (priv->tx_gpio != 0)
              {
                stm32_configgpio((priv->tx_gpio & ~(GPIO_PUPD_MASK |
                                                      GPIO_OPENDRAIN)) |
                                                      gpio_val);
              }

            cr |= USART_CR3_HDSEL;
          }
        else
          {
            if (priv->tx_gpio != 0)
              {
                stm32_configgpio((priv->tx_gpio & ~(GPIO_PUPD_MASK |
                                                      GPIO_OPENDRAIN)) |
                                                      GPIO_PUSHPULL);
              }

            cr &= ~USART_CR3_HDSEL;
          }

