apache/nuttx/arch/arm/src/stm32l4/stm32l4_serial.c
#ifdef SERIAL_HAVE_RXDMA
static bool stm32l4serial_dmarxavailable(struct uart_dev_s *dev)
{
  struct stm32_serial_s *priv =
      (struct stm32_serial_s *)dev->priv;

  /* Compare our receive pointer to the current DMA pointer, if they
   * do not match, then there are bytes to be received.
   */

  return (stm32l4serial_dmanextrx(priv) != priv->rxdmanext);
}
#endif

/****************************************************************************
 * Name: stm32l4serial_send
 *
 * Description:
 *   This method will send one byte on the USART
 *
 ****************************************************************************/

static void stm32l4serial_send(struct uart_dev_s *dev, int ch)
{
  struct stm32_serial_s *priv =
      (struct stm32_serial_s *)dev->priv;

#ifdef HAVE_RS485
  if (priv->rs485_dir_gpio != 0)
    {
      stm32_gpiowrite(priv->rs485_dir_gpio, priv->rs485_dir_polarity);
    }
#endif

  stm32l4serial_putreg(priv, STM32_USART_TDR_OFFSET, (uint32_t)ch);
}

/****************************************************************************
 * Name: stm32l4serial_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts
 *
 ****************************************************************************/

static void stm32l4serial_txint(struct uart_dev_s *dev, bool enable)
{
  struct stm32_serial_s *priv =
      (struct stm32_serial_s *)dev->priv;

  irqstate_t flags;

  /* USART transmit interrupts:
   *
   * Enable             Status          Meaning            Usage
   * ------------------ --------------- ----------------   ----------
   * USART_CR1_TCIE     USART_ISR_TC     Transmission
   *                                     Complete          (used only
   *                                                       for RS-485)
   * USART_CR1_TXEIE    USART_ISR_TXE    Transmit Data
   *                                     Register Empty
   * USART_CR3_CTSIE    USART_ISR_CTS    CTS flag          (not used)
   */

  flags = enter_critical_section();
  if (enable)
    {
      /* Set to receive an interrupt when the TX data register is empty */

#ifndef CONFIG_SUPPRESS_SERIAL_INTS
      uint16_t ie = priv->ie | USART_CR1_TXEIE;

      /* If RS-485 is supported on this U[S]ART, then also enable the
       * transmission complete interrupt.
       */

#  ifdef HAVE_RS485
      if (priv->rs485_dir_gpio != 0)
        {
          ie |= USART_CR1_TCIE;
        }
#  endif

#  ifdef CONFIG_STM32_SERIALBRK_BSDCOMPAT
      if (priv->ie & USART_CR1_IE_BREAK_INPROGRESS)
        {
          leave_critical_section(flags);
          return;
        }
#  endif

      stm32l4serial_restoreusartint(priv, ie);

      /* Fake a TX interrupt here by just calling uart_xmitchars() with
       * interrupts disabled (note this may recurse).
       */

      uart_xmitchars(dev);
#endif
    }
  else
    {
      /* Disable the TX interrupt */

      stm32l4serial_restoreusartint(priv, priv->ie & ~USART_CR1_TXEIE);
    }

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: stm32l4serial_txready
 *
 * Description:
 *   Return true if the transmit data register is empty
 *
 ****************************************************************************/

static bool stm32l4serial_txready(struct uart_dev_s *dev)
{
  struct stm32_serial_s *priv =
      (struct stm32_serial_s *)dev->priv;
  return ((stm32l4serial_getreg(priv, STM32_USART_ISR_OFFSET) &
           USART_ISR_TXE) != 0);
}

/****************************************************************************
 * Name: stm32l4serial_dmarxcallback
 *
 * Description:
 *   This function checks the current DMA state and calls the generic
 *   serial stack when bytes appear to be available.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static void stm32l4serial_dmarxcallback(DMA_HANDLE handle, uint8_t status,
                                        void *arg)
{
  struct stm32_serial_s *priv = (struct stm32_serial_s *)arg;

  if (priv->rxenable && stm32l4serial_dmarxavailable(&priv->dev))
    {
      uart_recvchars(&priv->dev);

#ifdef CONFIG_SERIAL_IFLOWCONTROL
      if (priv->iflow)
        {
          /* Re-enable RX DMA. */

          stm32l4serial_dmaiflowrestart(priv);
        }
#endif
    }

  /* Get the masked USART status word to check and clear error flags.
   *
   * When wake-up from low power mode was not fast enough, UART is resumed
   * too late and sometimes exactly when character was coming over UART,
   * resulting to frame error.

   * If error flag is not cleared, Rx DMA will be stuck. Clearing errors
   * will release Rx DMA.
   */

  priv->sr = stm32l4serial_getreg(priv, STM32_USART_ISR_OFFSET);

  if ((priv->sr & (USART_ISR_ORE | USART_ISR_NF | USART_ISR_FE)) != 0)
    {
      stm32l4serial_putreg(priv, STM32_USART_ICR_OFFSET,
                           (USART_ICR_NCF | USART_ICR_ORECF |
                            USART_ICR_FECF));
    }
}
#endif

/****************************************************************************
 * Name: stm32l4serial_pmnotify
 *
 * Description:
 *   Notify the driver of new power state. This callback is  called after
 *   all drivers have had the opportunity to prepare for the new power state.
 *
 * Input Parameters:
 *
 *    cb - Returned to the driver. The driver version of the callback
 *         structure may include additional, driver-specific state data at
 *         the end of the structure.
 *
 *    pmstate - Identifies the new PM state
 *
 * Returned Value:
 *   None - The driver already agreed to transition to the low power
 *   consumption state when when it returned OK to the prepare() call.
 *
 *
 ****************************************************************************/

#ifdef CONFIG_PM
static void stm32l4serial_pmnotify(struct pm_callback_s *cb, int domain,
                                   enum pm_state_e pmstate)
{
  switch (pmstate)
    {
      case PM_NORMAL:
        {
          stm32l4serial_pm_setsuspend(false);
        }
        break;

      case PM_IDLE:
        {
          stm32l4serial_pm_setsuspend(false);
        }
        break;

